{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-) Press G to change the language to Gujarati",
        "Hello, thanks for visiting! Press G to change the language to Gujarati",
        "Hi there, what can I do for you? Press G to change the language to Gujarati",
        "Hi there, how can I help? Press G to change the language to Gujarati"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "NFT",
      "patterns": [
        "What is an NFT",
        "What are NFT?",
        "How do i mint a NFT?"
      ],
      "responses": [
        "NFTs is an acronym for Non-Fungible Tokens.Non-Fungible in the sense that they are unique and cannot be interchanged like fungible assets such as Bitcoin. Lets take for example if you exchange a Bitcoin to get another, nothing changes, you still get the same Bitcoin back — its the opposite in the case of NFTs."
      ]
    },
    {
      "tag": "create",
      "patterns": [
        "How do i create an NFT?"
      ],
      "responses": [
        "You can mint or create an NFT by going to the 'List NFT' section of Parivartan."
      ]
    },
    {
      "tag": "gas",
      "patterns": [
        "What are gas fees?"
      ],
      "responses": [
        "Gas fees are the fees paid by the user to push changes on to the blockchain. Gas fees are variable. They depend heavily on the amount of of traffic on the chain. We plan to reduce our gas fees using biconomy in the future"
      ]
    },
    {
      "tag": "buy NFT",
      "patterns": [
        "How do i buy an NFT?"
      ],
      "responses": [
        "To buy an NFT, you first need to connect your wallet to the marketplace. Then navigate to the page of the NFT you want to buy and click on purchase NFT and pay the required transaction fees"
      ]
    },
    {
      "tag": "sell NFT",
      "patterns": [
        "How do i sell an NFT?"
      ],
      "responses": [
        "To sell an NFT, you should click on the list NFT option on the Home page, Upload the NFT you own, decide the selling price and click on 'List NFT'. After that you'll need to pay the gas fees and then your NFT will be listed on the Marketplace."
      ]
    },
    {
      "tag": "create",
      "patterns": [
        "How do i mint NFT?"
      ],
      "responses": [
        "You can mint or create an NFT by going to the 'List NFT' section of Parivartan."
      ]
    },
    {
      "tag": "mint",
      "patterns": [
        "How do i mint NFT?"
      ],
      "responses": [
        "You can mint or create an NFT by going to the 'List NFT' section of Parivartan."
      ]
    },
    {
      "tag": "wallet",
      "patterns": [
        "What is a crypto wallet?",
        "How do i connect my wallet?"
      ],
      "responses": [
        "Unlike a normal wallet, which can hold actual cash, crypto wallets technically dont store your crypto. Your holdings live on the blockchain, but can only be accessed using a private key. You can connect your metamask wallet by clicking on the top right section named 'Connect Wallet'"
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "How will i get paid if someone buys my NFT?"
      ],
      "responses": [
        "You will be paid in crypto which will directly be sent to you connected wallet"
      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    }
  ]
}
